# Accessing Elements in Pandas DataFrames

In [88]:
import pandas as pd
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

## Access elements in Pandas DataFrames in many different ways

In [91]:
# important : dataframe[column][row]
# We print the store_items DataFrame
print(store_items)

# We access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc['store 1'])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])
print()
print('How many bikes are in Store 2:', store_items.loc['store 2','bikes'])
print()
print('How many bikes and glasses are in store 1 and Store 2:\n',store_items.loc[: ,'bikes':'glasses'])
print()
print('goasses to waches for store1 and store2:\n',store_items.loc['store 1':'store 2','bikes':'watches'])
print()
print('goasses to waches for store1 and store2:\n',store_items.loc['store 1':'store 2']['bikes':'watches'])

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
 bikes      20.0
glasses     NaN
pants      30.0
watches    35.0
Name: store 1, dtype: float64

How many bikes are in Store 2: 15

How many bikes are in Store 2: 15

How many bikes and glasses are in store 1 and Store 2:
          bikes  glasses
store 1     20      NaN
store 2     15     50.0

goasses to waches for store1 and store2:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

goasses to waches for store1 and store2:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

## Modify our DataFrames by adding rows or columns

In [76]:
# We add a new column named shirts to our store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

## Add new columns by using arithmetic operations between other columns in our DataFrame

In [77]:
# We make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

## How to add new rows to our DataFrame ?


### First : create new DatatFrame for this row

In [78]:
# We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

### Second: add this row to our store_items DataFrame by using the .append() method

In [79]:
# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

## Add new columns  by using only data from particular rows

In [80]:
# We add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches']['store 2': ]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

## Insert new columns into the DataFrames anywhere we want

In [81]:
# dataframe.insert(loc,label,data)

# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,9])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      9    NaN       35         35.0

## Delete columns from our DataFrame using .pop()

In [82]:
# We remove the new watches column
store_items.pop('new watches')

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      9    NaN       35

## Delete columns or rows from our DataFrame using .drop()

In [83]:
# We remove the watches and shoes columns
store_items = store_items.drop([ 'watches','shoes'], axis = 1)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [84]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

## Rename row or column labels

In [85]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [86]:
# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

## change the index to be one of the columns in the DataFrame

In [56]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN